2023-12-18/164db53ad1-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux insmod报错问题探究</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">linux insmod报错问题探究</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org628076f">1. 模块构建构成modpost文件</a></li>
</ul>
</div>
</div>
<p>
如果使能CONFIG_MODVERSIONS，则modinfo中的vermagic内核版本不用和内核保持一致。但会
增加一个内核导出符号的CRC校验。
如果没使能CONFIG_MODVERSIONS，则modinfo中的vermagic需要和内核版本保持一致。
</p>

<p>
内核版本一致，也就是vermagic一样。
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">  #if</span><span style="font-weight: bold;">n</span><span style="font-weight: bold;">def</span> _LINUX_VERMAGIC_H
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">_LINUX_VERMAGIC_H</span>

<span style="font-weight: bold;">#if</span><span style="font-weight: bold;">n</span><span style="font-weight: bold;">def</span> INCLUDE_VERMAGIC
<span style="font-weight: bold;">#error</span> <span style="font-style: italic;">"This header can be included from kernel/module.c or *.mod.c only"</span>
<span style="font-weight: bold;">#endif</span>

<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;generated/utsrelease.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;asm/vermagic.h&gt;</span>

<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Simply sanity version stamp for modules.</span><span style="font-weight: bold; font-style: italic;"> */</span>
<span style="font-weight: bold;">#ifdef</span> CONFIG_SMP
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_SMP</span> <span style="font-style: italic;">"SMP "</span>
<span style="font-weight: bold;">#else</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_SMP</span> <span style="font-style: italic;">""</span>
<span style="font-weight: bold;">#endif</span>
<span style="font-weight: bold;">#ifdef</span> CONFIG_PREEMPT_BUILD
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_PREEMPT</span> <span style="font-style: italic;">"preempt "</span>
<span style="font-weight: bold;">#elif</span> <span style="font-weight: bold;">defined</span>(CONFIG_PREEMPT_RT)
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_PREEMPT</span> <span style="font-style: italic;">"preempt_rt "</span>
<span style="font-weight: bold;">#else</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_PREEMPT</span> <span style="font-style: italic;">""</span>
<span style="font-weight: bold;">#endif</span>
<span style="font-weight: bold;">#ifdef</span> CONFIG_MODULE_UNLOAD
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_MODULE_UNLOAD</span> <span style="font-style: italic;">"mod_unload "</span>
<span style="font-weight: bold;">#else</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_MODULE_UNLOAD</span> <span style="font-style: italic;">""</span>
<span style="font-weight: bold;">#endif</span>
<span style="font-weight: bold;">#ifdef</span> CONFIG_MODVERSIONS
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_MODVERSIONS</span> <span style="font-style: italic;">"modversions "</span>
<span style="font-weight: bold;">#else</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_VERMAGIC_MODVERSIONS</span> <span style="font-style: italic;">""</span>
<span style="font-weight: bold;">#endif</span>
<span style="font-weight: bold;">#ifdef</span> RANDSTRUCT
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;generated/randstruct_hash.h&gt;</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_RANDSTRUCT</span> <span style="font-style: italic;">"RANDSTRUCT_"</span> RANDSTRUCT_HASHED_SEED
<span style="font-weight: bold;">#else</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MODULE_RANDSTRUCT</span>
<span style="font-weight: bold;">#endif</span>

<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">VERMAGIC_STRING</span>                                                 \
        UTS_RELEASE <span style="font-style: italic;">" "</span>                                                 \
        MODULE_VERMAGIC_SMP MODULE_VERMAGIC_PREEMPT                     \
        MODULE_VERMAGIC_MODULE_UNLOAD MODULE_VERMAGIC_MODVERSIONS       \
        MODULE_ARCH_VERMAGIC                                            \
        MODULE_RANDSTRUCT
</pre>
</div>
<p>
由上可知，vermagic和一下内容有关：
UTS_RELEASE: file: include/generated/utsrelease.h:1 #define UTS_RELEASE "6.5.0-ge74493e69135-dirty"，如果不想ge744...那个数字改变，可以在root/Makefile中填上EXTRAVERSION=xxx
MODULE_VERMAGIC_SMP: 是否开启SMP
MODULE_VERMAGIC_PREEMPT: 是否开启抢占
MODULE_VERMAGIC_MODULE_UNLOAD: 是否开启模块卸载
MODULE_VERMAGIC_MODVERSIONS: 是否开启modversions功能
MODULE_ARCH_VERMAGIC
MODULE_RANDSTRUCT: 是否支持randstruct功能，也就是struct布局不对齐。
</p>

<p>
mod.c文件由modpost生成。
</p>

<p>
文件编译先后顺序:
git-branch::master linux-6.5 $ make modules
  SYNC    include/config/auto.conf.cmd
  HOSTCC  scripts/genksyms/genksyms.o
  YACC    scripts/genksyms/parse.tab.[ch]
  HOSTCC  scripts/genksyms/parse.tab.o
  LEX     scripts/genksyms/lex.lex.c
  HOSTCC  scripts/genksyms/lex.lex.o
  HOSTLD  scripts/genksyms/genksyms
  HOSTCC  scripts/mod/modpost.o
  <b>HOSTLD  scripts/mod/modpost</b>
  CC      kernel/bounds.s
  CC      arch/arm/kernel/asm-offsets.s
  CALL    scripts/checksyscalls.sh
  CC      init/main.o
  ......
  ......
  ......
  ......
  ......
  ......
  ......
  CC      drivers/of/address.o
  CC      drivers/of/irq.o
  CC      drivers/of/of_reserved_mem.o
  AR      drivers/of/built-in.a
  CC      drivers/nvmem/core.o
  AR      drivers/nvmem/built-in.a
  AR      drivers/built-in.a
  AR      built-in.a
  AR      vmlinux.a
  LD      vmlinux.o
  OBJCOPY modules.builtin.modinfo
  GEN     modules.builtin
  GEN     .vmlinux.objs
  <b>MODPOST Module.symvers</b>
  CC [M]  drivers/irqchip/irq-imx-mu-msi.mod.o
  LD [M]  drivers/irqchip/irq-imx-mu-msi.ko
  CC [M]  drivers/dma/imx-sdma.mod.o
  LD [M]  drivers/dma/imx-sdma.ko
  CC [M]  drivers/char/hw_random/rng-core.mod.o
  LD [M]  drivers/char/hw_random/rng-core.ko
  CC [M]  drivers/char/hw_random/imx-rngc.mod.o
  LD [M]  drivers/char/hw_random/imx-rngc.ko
</p>

<p>
使用modinfo报错时，可采用depmod命令生成modules.dep
modinfo: can't open '/lib/modules/6.5.0-ge74493e69135-dirty/modules.dep': No such file or directory
</p>

<div id="outline-container-org628076f" class="outline-2">
<h2 id="org628076f"><span class="section-number-2">1.</span> 模块构建构成modpost文件</h2>
<div class="outline-text-2" id="text-1">
<p>
reference: scripts/Makefile.modpost
</p>
<ol class="org-ol">
<li>编译模块文件
<ol class="org-ol">
<li>编译单独的.o文件。</li>
<li>链接上述.o文件，成&lt;module&gt;.o文件。</li>
<li>创建&lt;module&gt;.mod文件，文件包含上述文件名。</li>
<li>创建modules.order文件，包含当前目录下所有模块。</li>
</ol></li>

<li>由Makefile.modpost文件操作如下：
<ol class="org-ol">
<li>找到所有在modules.order中的文件。</li>
<li>modpost工具创建&lt;module&gt;.mod.c</li>
<li>创建文件Module.symvers，每个导出符号都带有CRC</li>
</ol></li>

<li><p>
放置一些模块信息到模块的ELF文件section中，包含信息如下：
Version magic (see include/linux/vermagic.h for full details)
</p>
<ul class="org-ul">
<li>Kernel release</li>
<li>SMP is CONFIG_SMP</li>
<li>PREEMPT is CONFIG_PREEMPT[_RT]</li>
<li>GCC Version</li>
</ul>
<p>
Module info
</p>
<ul class="org-ul">
<li>Module version (MODULE_VERSION)</li>
<li>Module alias'es (MODULE_ALIAS)</li>
<li>Module license (MODULE_LICENSE)</li>
<li>See include/linux/module.h for more details</li>
</ul></li>

<li>构建外部模块，从Module.symvers中检索每个模块的CRC。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
